IRP/src/InformationRegisters/ExecutionProcessStatus/ExecutionProcessStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExecutionProcessStatus</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>CurrentStage</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>CurrentTask</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>IterationNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ExecutionProcess</name>
    <type>
      <types>BusinessProcessRef.ExecutionProcesses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StatusTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/ExecutionProcessStatus/ManagerModule.bsl
#Region AccessObject

// Get access key.
// See Role.TemplateInformationRegisters
// 
// Returns:
//  Structure - Get access key:
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	Return AccessKeyStructure;
EndFunction

#EndRegion

// Get last status.
// 
// Parameters:
//  ExecutionProcess - BusinessProcessRef.ExecutionProcesses - Execution process
// 
// Returns:
//  Structure - Get last status:
//	* ExecutionProcess - BusinessProcessRef.ExecutionProcesses
//	* Period - Date
//	* StatusTime - Number
//	* CurrentStage - UUID
//	* CurrentTask - UUID
//	* IterationNumber - Number
Function GetLastStatus(ExecutionProcess) Export
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	ExecutionProcessStatus.ExecutionProcess,
	|	ExecutionProcessStatus.Period AS Period,
	|	ExecutionProcessStatus.StatusTime AS StatusTime,
	|	ExecutionProcessStatus.CurrentStage,
	|	ExecutionProcessStatus.CurrentTask,
	|	ExecutionProcessStatus.IterationNumber
	|FROM
	|	InformationRegister.ExecutionProcessStatus AS ExecutionProcessStatus
	|WHERE
	|	ExecutionProcessStatus.ExecutionProcess = &ExecutionProcess
	|
	|ORDER BY
	|	Period DESC,
	|	StatusTime DESC";
	
	Query.SetParameter("ExecutionProcess", ExecutionProcess);
	
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		Return QuerySelection;
	EndIf;
	
	Return InformationRegisters.ExecutionProcessStatus.GetLast(, New Structure("ExecutionProcess", ExecutionProcess));
	
EndFunction
